# FileExportedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileExportedEventArgs Class
Members See Also
---
The event arguments used by the FileExported event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public class FileExportedEventArgs : RevitAPIPostDocEventArgs
```

Visual Basic
---
```text
Public Class FileExportedEventArgs _
	Inherits RevitAPIPostDocEventArgs
```

Visual C++
---
```text
public ref class FileExportedEventArgs : public RevitAPIPostDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..FileExportedEventArgs
# See Also
FileExportedEventArgs Members
Autodesk.Revit.DB.Events Namespace